In [1]:
import pandas as pd
import numpy as np

In [3]:
data = pd.DataFrame({'Brand' : ['Maruti', 'Hyundai', 'Tata', 
                                'Mahindra', 'Maruti', 'Hyundai', 
                                'Renault', 'Tata', 'Maruti'], 
                     'Year' : [2012, 2014, 2011, 2015, 2012,  
                               2016, 2014, 2018, 2019], 
                     'Kms Driven' : [50000, 30000, 60000,  
                                     25000, np.nan, 46000,  
                                     31000, 15000, 12000], 
                     'City' : ['Gurgaon', 'Delhi', 'Mumbai',  
                               'Delhi', 'Mumbai', 'Delhi',  
                               'Mumbai','Chennai',  'Ghaziabad'], 
                     'Mileage' :  [28, 27, 25, np.nan, 28,  
                                   29, 24, np.nan, 24]})

In [4]:
data

      Brand  Year  Kms Driven       City  Mileage
0    Maruti  2012     50000.0    Gurgaon     28.0
1   Hyundai  2014     30000.0      Delhi     27.0
2      Tata  2011     60000.0     Mumbai     25.0
3  Mahindra  2015     25000.0      Delhi      NaN
4    Maruti  2012         NaN     Mumbai     28.0
5   Hyundai  2016     46000.0      Delhi     29.0
6   Renault  2014     31000.0     Mumbai     24.0
7      Tata  2018     15000.0    Chennai      NaN
8    Maruti  2019     12000.0  Ghaziabad     24.0

In [9]:
data['Mileage'].mean()

26.428571428571427

In [10]:
data['Mileage']

0    28.0
1    27.0
2    25.0
3     NaN
4    28.0
5    29.0
6    24.0
7     NaN
8    24.0
Name: Mileage, dtype: float64

### Filling the missing values with .repalce method

In [7]:
data['Mileage'].replace(np.NAN,data['Mileage'].mean())

0    28.000000
1    27.000000
2    25.000000
3    26.428571
4    28.000000
5    29.000000
6    24.000000
7    26.428571
8    24.000000
Name: Mileage, dtype: float64

### Filling the missing values wiht .fillna method

In [11]:
data['Mileage'].fillna(data['Mileage'].mean())

0    28.000000
1    27.000000
2    25.000000
3    26.428571
4    28.000000
5    29.000000
6    24.000000
7    26.428571
8    24.000000
Name: Mileage, dtype: float64